first_steps.org
#+TITLE:     First Steps
#+AUTHOR:    Hugo Duncan
#+EMAIL:     hugo_duncan@yahoo.com
#+DATE:      2010-06-17 Thu
#+DESCRIPTION: Pallet first steps introduction
#+KEYWORDS: pallet introduction install first
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP: index.html
#+LINK_HOME: index.html
#+property: exports code
#+property: results output
#+property: cache true
#+STYLE: <link rel="stylesheet" type="text/css" href="doc.css" />

#+MACRO: clojure [[http://clojure.org][Clojure]]
#+MACRO: jclouds [[http://jclouds.org][jclouds]]
#+MACRO: leiningen [[http://github.com/technomancy/leiningen][leiningen]]
#+MACRO: maven [[http://maven.apache.org/][maven]]

The simplest way to start pallet is with a git checkout of the [[https://github.com/hugoduncan/pallet-examples][pallet-examples
project]].

* Install

Pallet can be used as a jar file or from a source code checkout.  Release versions
are available at [[http://oss.sonatype.org/content/repositories/releases/org/cloudhoist][Sonatype]], and can be used with {{{maven}}}, {{{leiningen}}} or any
maven repository aware tool.

** Lein/Cake

Include the following in your project.clj

#+begin_src clojure
:dependencies [[org.cloudhoist/pallet "0.3.0"]
               [org.cloudhoist/pallet-crates-complete "0.3.0"]]
:repositories {"sonatype"
               "http://oss.sonatype.org/content/repositories/releases"
               "sonatype-snapshots"
               "http://oss.sonatype.org/content/repositories/snapshots"}
#+end_src

** Maven
Include the following in your pom.xml.

#+begin_src xml :results silent :session s1
    <dependencies>
      <dependency>
        <groupId>org.cloudhoist</groupId>
        <artifactId>pallet</artifactId>
        <version>0.4.0-SNAPSHOT</version>
      </dependency>
      <dependency>
        <groupId>org.cloudhoist</groupId>
        <artifactId>pallet</artifactId>
        <version>0.4.0-SNAPSHOT</version>
      </dependency>
    <dependencies>

    <repositories>
      <repository>
        <id>sonatype</id>
        <url>http://oss.sonatype.org/content/repositories/releases</url>
      </repository>
      <repository>
        <id>sonatype-snapshots</id>
        <url>http://oss.sonatype.org/content/repositories/snapshots</url>
      </repository>
    </repositories>
#+end_src


* Source
Pallet is available on [[http://github.com/hugoduncan/pallet][github]]. Pallet requires [[http://clojure.org/][Clojure 1.2]], and uses {{{jclouds}}}.

#+BEGIN_SRC sh :dir tmp
  git clone git://github.com/hugoduncan/pallet.git
  git clone git://github.com/hugoduncan/pallet-crates.git
#+END_SRC
