first_steps.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>First Steps</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-17 Thu"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet first steps introduction"/>
<meta name="keywords" content="pallet introduction install first"/>
<link rel="stylesheet" type="text/css" href="doc.css" />

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<h1 class="title">First Steps</h1>


<p>
The simplest way to start pallet is with a git checkout of the <a href="https://github.com/hugoduncan/pallet-examples">pallet-examples project</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Install </h2>
<div class="outline-text-2" id="text-1">


<p>
Pallet can be used as a jar file or from a source code checkout.  Release versions
are available at <a href="http://oss.sonatype.org/content/repositories/releases/org/cloudhoist">Sonatype</a>, and can be used with <a href="http://maven.apache.org/">maven</a>, <a href="http://github.com/technomancy/leiningen">leiningen</a> or any
maven repository aware tool.
</p>

</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1">Lein/Cake </h3>
<div class="outline-text-3" id="text-1_1">


<p>
Include the following in your project.clj
</p>



<pre class="src src-clojure"><span style="color: #0000ff;">:dependencies</span> [[org.cloudhoist/pallet <span style="color: #f4a460;">"0.3.0"</span>]
               [org.cloudhoist/pallet-crates-complete <span style="color: #f4a460;">"0.3.0"</span>]]
<span style="color: #0000ff;">:repositories</span> {<span style="color: #f4a460;">"sonatype"</span>
               <span style="color: #f4a460;">"http://oss.sonatype.org/content/repositories/releases"</span>
               <span style="color: #f4a460;">"sonatype-snapshots"</span>
               <span style="color: #f4a460;">"http://oss.sonatype.org/content/repositories/snapshots"</span>}
</pre>



</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2">Maven </h3>
<div class="outline-text-3" id="text-1_2">

<p>Include the following in your pom.xml.
</p>



<pre class="src src-xml"><span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">dependencies</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">dependency</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">groupId</span><span style="color: #00cd00;">&gt;</span>org.cloudhoist<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">groupId</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">artifactId</span><span style="color: #00cd00;">&gt;</span>pallet<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">artifactId</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">version</span><span style="color: #00cd00;">&gt;</span>0.4.0-SNAPSHOT<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">version</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">dependency</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">dependency</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">groupId</span><span style="color: #00cd00;">&gt;</span>org.cloudhoist<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">groupId</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">artifactId</span><span style="color: #00cd00;">&gt;</span>pallet<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">artifactId</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">version</span><span style="color: #00cd00;">&gt;</span>0.4.0-SNAPSHOT<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">version</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">dependency</span><span style="color: #00cd00;">&gt;</span>
<span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">dependencies</span><span style="color: #00cd00;">&gt;</span>

<span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">repositories</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">repository</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">id</span><span style="color: #00cd00;">&gt;</span>sonatype<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">id</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">url</span><span style="color: #00cd00;">&gt;</span>http://oss.sonatype.org/content/repositories/releases<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">url</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">repository</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">repository</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">id</span><span style="color: #00cd00;">&gt;</span>sonatype-snapshots<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">id</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">url</span><span style="color: #00cd00;">&gt;</span>http://oss.sonatype.org/content/repositories/snapshots<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">url</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">repository</span><span style="color: #00cd00;">&gt;</span>
<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">repositories</span><span style="color: #00cd00;">&gt;</span>
</pre>




</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Source </h2>
<div class="outline-text-2" id="text-2">

<p>Pallet is available on <a href="http://github.com/hugoduncan/pallet">github</a>. Pallet requires <a href="http://clojure.org/">Clojure 1.2</a>, and uses <a href="http://jclouds.org">jclouds</a>.
</p>



<pre class="src src-sh">git clone git://github.com/hugoduncan/pallet.git
git clone git://github.com/hugoduncan/pallet-crates.git
</pre>


</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2010-06-17 Thu</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
